# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ft_strdup.s                                        :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: smatha <smatha@student.42.fr>              +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/03 14:32:39 by smatha            #+#    #+#              #
#    Updated: 2020/10/04 21:14:23 by smatha           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

;создает строку дубликат, выделяет на нее память и заполняет, возвращает ее

section .text
	global _ft_strdup
	extern _malloc

