# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ft_strcpy.s                                        :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: smatha <smatha@student.42.fr>              +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/03 14:31:25 by smatha            #+#    #+#              #
#    Updated: 2020/10/04 21:16:04 by smatha           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

;копирует n-1 байт из S в dest, последний n = '\0', возращает длину s

section .text
	global _ft_strcpy


