# **************************************************************************** #
#                                                                              #
#                                                         :::      ::::::::    #
#    ft_strcmp.s                                        :+:      :+:    :+:    #
#                                                     +:+ +:+         +:+      #
#    By: smatha <smatha@student.42.fr>              +#+  +:+       +#+         #
#                                                 +#+#+#+#+#+   +#+            #
#    Created: 2020/10/03 14:31:45 by smatha            #+#    #+#              #
#    Updated: 2020/10/04 21:18:21 by smatha           ###   ########.fr        #
#                                                                              #
# **************************************************************************** #

; Эта функция сравнивает символы двух строк, string1 и string2.
;Начиная с первых символов функция strcmp сравнивает поочередно каждую пару символов,
;пока не будут найдены различные символы или не будет достигнут конец строки.

section .text
	global _ft_strcmp
